Core/src/src/Documents/СписаниеТопливаЗапасов/СписаниеТопливаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТопливаЗапасов</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаОСиТС</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоРасходуТС</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеТопливаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСДатойДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегОкончание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегРазница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйБак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/СписаниеТопливаЗапасов/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТопливаЗапасов.Ссылка 							КАК Ссылка,
	|	СписаниеТопливаЗапасов.Дата 							КАК Период,
	|	СписаниеТопливаЗапасов.ВидОперации 						КАК ВидОперации,
	|	СписаниеТопливаЗапасов.НаправлениеДеятельности 			КАК НаправлениеДеятельности,
	|	СписаниеТопливаЗапасов.Организация 						КАК Организация,
	|	СписаниеТопливаЗапасов.Подразделение 					КАК Подразделение,
	|	СписаниеТопливаЗапасов.СчетУчетаЗатрат 					КАК СчетУчетаЗатрат,
	|	СписаниеТопливаЗапасов.ПроводитьСДатойДокумента 		КАК ПроводитьСДатойДокумента,
	|	СписаниеТопливаЗапасов.СтруктурнаяЕдиница 				КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов КАК СписаниеТопливаЗапасов
	|ГДЕ
	|	СписаниеТопливаЗапасов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеТопливаЗапасовРасходы.Ссылка 							КАК Ссылка,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.Организация 				КАК Организация,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.ПроводитьСДатойДокумента 	КАК ПроводитьСДатойДокумента,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.ВидОперации 				КАК ВидОперации,
	|	СписаниеТопливаЗапасовРасходы.НомерСтроки 						КАК НомерСтроки,
	|	СписаниеТопливаЗапасовРасходы.Дата 								КАК ДатаСписания,
	|	СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив 				КАК ВнеоборотныйАктив,
	|	СписаниеТопливаЗапасовРасходы.НомерВА 							КАК НомерВА,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура 						КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)			КАК Партия,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатрат		КАК СчетУчетаЗатрат,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗапасов		КАК СчетУчетаЗапасов,
	|	ВЫБОР
	|		КОГДА СписаниеТопливаЗапасовРасходы.Ссылка.ПроводитьСДатойДокумента
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Ссылка.Дата
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР 
	|		КОГДА СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатратРегл
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчетаЗатратРегл,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗапасовРегл	КАК СчетУчетаЗапасовРегл,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов 
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаУчетаЗатратРегл,
	|	СписаниеТопливаЗапасовРасходы.Характеристика 					КАК Характеристика,
	|	СписаниеТопливаЗапасовРасходы.ЕдиницаИзмерения 					КАК ЕдиницаИзмерения,
	|	СписаниеТопливаЗапасовРасходы.Количество 						КАК Количество,
	|	СписаниеТопливаЗапасовРасходы.ПробегНачало 						КАК ПробегНачало,
	|	СписаниеТопливаЗапасовРасходы.ПробегОкончание 					КАК ПробегОкончание,
	|	СписаниеТопливаЗапасовРасходы.ПробегРазница 					КАК ПробегРазница,
	|	СписаниеТопливаЗапасовРасходы.ПолныйБак 						КАК ПолныйБак,
	|	СписаниеТопливаЗапасовРасходы.СтруктурнаяЕдиница 				КАК СтруктурнаяЕдиница,
	|	СписаниеТопливаЗапасовРасходы.Подразделение 					КАК Подразделение,
	|	СписаниеТопливаЗапасовРасходы.НаправлениеДеятельности 			КАК НаправлениеДеятельности,
	|	&ВалютаУчета													КАК ВалютаУчета,
	|	ВЫБОР
	|		КОГДА СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив <> ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив) = ТИП(Справочник.ТранспортныеСредства) 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТС,
	|	0 КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов.Расходы КАК СписаниеТопливаЗапасовРасходы
	|ГДЕ
	|	СписаниеТопливаЗапасовРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеТопливаЗапасов);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДанныеПоРасходуТС_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Ячейка,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (НЕ ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница.ОрдерныйСклад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =            
	"ВЫБРАТЬ
	|	ТаблицаРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаРасходы.Период КАК Период,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаРасходы.ДатаСписания КАК ДатаСписания,
	|	ТаблицаРасходы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаРасходы.СчетУчетаЗатрат КАК КоррСчетУчета,
	|	ТаблицаРасходы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаРасходы.НомерВА КАК НомерВА,
	|	ТаблицаРасходы.ВидОперации КАК Операция,
	|	ТаблицаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК Склад,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	СУММА(ТаблицаРасходы.ПробегРазница) КАК Пробег,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК КоррСчетУчетаРегл,
	|	ТаблицаРасходы.ЭтоТС КАК ЭтоТС,
	|	ТаблицаРасходы.Номенклатура КАК Номенклатура,
	|	ТаблицаРасходы.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК КоррНоменклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК КоррХарактеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ТаблицаРасходы.Ссылка КАК ДокументПродажи,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК СчетДт,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетКт,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК Строка (100)) КАК СодержаниеПроводки,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК Строка (100)) КАК Содержание,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаВалДт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаВалКт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Количественный 
	|			ТОГДА ТаблицаРасходы.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоДт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Количественный 
	|			ТОГДА ТаблицаРасходы.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоКт,
	|   ""Подразделения"" КАК ВидСубконтоДт1,
	|   ""СотрудникНоменклатура"" КАК ВидСубконтоДт2,
	|   ""ОСТС"" КАК ВидСубконтоДт3,
	|   ""Склады"" КАК ВидСубконтоКт1,
	|   ""Номенклатура"" КАК ВидСубконтоКт2,
	|   ""ХарактеристикиНоменклатуры"" КАК ВидСубконтоКт3,
	|   ТаблицаРасходы.Подразделение КАК СубконтоДт1,
	|   ТаблицаРасходы.Номенклатура КАК СубконтоДт2,
	|   ТаблицаРасходы.ВнеоборотныйАктив КАК СубконтоДт3,
	|   ТаблицаРасходы.СтруктурнаяЕдиница КАК СубконтоКт1,
	|   ТаблицаРасходы.Номенклатура КАК СубконтоКт2,
	|   ТаблицаРасходы.Характеристика КАК СубконтоКт3,
	|	СУММА(ТаблицаРасходы.Количество) КАК Количество,
	|	СУММА(ТаблицаРасходы.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Период,
	|	ТаблицаРасходы.НомерСтроки,
	|	ТаблицаРасходы.Ссылка,
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл,
	|	ТаблицаРасходы.Номенклатура,
	|	ТаблицаРасходы.Характеристика,
	|	ТаблицаРасходы.ДатаСписания,
	|	ТаблицаРасходы.ВидОперации,
	|	ТаблицаРасходы.СчетУчетаЗатрат,
	|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл,
	|	ТаблицаРасходы.ЭтоТС,
	|	ТаблицаРасходы.ВнеоборотныйАктив,
	|	ТаблицаРасходы.НомерВА,
	|	ТаблицаРасходы.НаправлениеДеятельности,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	|	ТаблицаРасходы.Подразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаРасходы.СчетУчетаЗапасов";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатратыНаОСиТС", РезультатЗапроса.Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Колонки.Удалить("СчетУчета");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Колонки.Добавить("СчетУчета");
	
	КопияТаблицыЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Скопировать();
	КопияТаблицыЗапасы.Колонки.Добавить("КоррСтруктурнаяЕдиница"); //+++ Дмгг
	КопияТаблицыЗапасы.Очистить();
	
	//////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаРасходы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаРасходы.Номенклатура КАК Номенклатура,
	|	ТаблицаРасходы.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл,
	|	ТаблицаРасходы.Номенклатура,
	|	ТаблицаРасходы.Характеристика";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		Если КолонкаРезультатЗапроса.Имя <> "СчетУчетаЗатратРегл"
			И КолонкаРезультатЗапроса.Имя <> "КоррСчетУчета" 
			И КолонкаРезультатЗапроса.Имя <> "КоррСчетУчетаРегл" Тогда 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
		КонецЕсли;
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, 
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, 
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|					(ВЫБРАТЬ
	|						ТаблицаРасходы.Организация,
	|						ТаблицаРасходы.СтруктурнаяЕдиница,
	|						ТаблицаРасходы.СчетУчетаЗапасов,
	|						ТаблицаРасходы.СчетУчетаЗапасовРегл, 
	|						ТаблицаРасходы.Номенклатура,
	|						ТаблицаРасходы.Характеристика,
	|						ТаблицаРасходы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаРасходы КАК ТаблицаРасходы)) КАК ЗапасыОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл, 
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, 
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл,  //+++
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеТопливаЗапасов);
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
		
		КоличествоТребуется = СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуется > 0 Тогда
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуется Тогда
				
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуется / КоличествоОстаток , 2, 1);
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуется;
				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток = КоличествоТребуется Тогда
				
				СуммаКСписанию = СуммаОстаток;
				
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
			
			СтрокаТаблицаЗапасы.Сумма = СуммаКСписанию;
			СтрокаТаблицаЗапасы.Количество = КоличествоТребуется;
			
			// Восстанавливаем строку расхода
			Если СтрокаТаблицаЗапасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда 
				НоваяСтрокаКопииЗапасов = КопияТаблицыЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКопииЗапасов, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаКопииЗапасов.Сумма      = СуммаКСписанию;
				НоваяСтрокаКопииЗапасов.Количество = КоличествоТребуется;
				//+++ Дмгг
				Если НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
					ИЛИ НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
					
					НоваяСтрокаКопииЗапасов.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
					НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
					
				КонецЕсли;
				//--- Дмгг
			КонецЕсли;
			
			// Добавляем строку прихода
			Если НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда 
				
				НоваяСтрокаКопииЗапасов = КопияТаблицыЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКопииЗапасов, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаКопииЗапасов.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрокаКопииЗапасов.Сумма      = СуммаКСписанию;
				НоваяСтрокаКопииЗапасов.Количество = 0;//КоличествоТребуется;
				НоменклатураСтроки = НоваяСтрокаКопииЗапасов.Номенклатура;
				ХарактеристикаСтроки = НоваяСтрокаКопииЗапасов.Характеристика;
				НоваяСтрокаКопииЗапасов.Номенклатура = НоменклатураСтроки;//Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрокаКопииЗапасов.Характеристика = ХарактеристикаСтроки;//Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				НоваяСтрокаКопииЗапасов.КоррНоменклатура = НоменклатураСтроки;
				НоваяСтрокаКопииЗапасов.КоррХарактеристика = ХарактеристикаСтроки;
				СчетУчетаРасхода = НоваяСтрокаКопииЗапасов.СчетУчета;
				СчетУчетаРасходаРегл = НоваяСтрокаКопииЗапасов.СчетУчетаРегл;
				НоваяСтрокаКопииЗапасов.СчетУчета = НоваяСтрокаКопииЗапасов.КоррСчетУчета;
				НоваяСтрокаКопииЗапасов.КоррСчетУчета = СчетУчетаРасхода;
				НоваяСтрокаКопииЗапасов.СчетУчетаРегл = НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл;
				НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл = СчетУчетаРасходаРегл;
				НоваяСтрокаКопииЗапасов.СтруктурнаяЕдиница = НоваяСтрокаКопииЗапасов.Подразделение;
				
			ИначеЕсли НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
				ИЛИ НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
				
				НоваяСтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаДоходыИРасходы.СчетУчета = НоваяСтрокаКопииЗапасов.КоррСчетУчета;
				НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = НоваяСтрокаКопииЗапасов.КоррСчетУчетаРегл;
				НоваяСтрокаДоходыИРасходы.СуммаРасходов = СуммаКСписанию;
				НоваяСтрокаДоходыИРасходы.Аналитика = НоваяСтрокаКопииЗапасов.Номенклатура;
				НоваяСтрокаДоходыИРасходы.СтруктурнаяЕдиница = НоваяСтрокаКопииЗапасов.Подразделение;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаЗатратыНаОСиТС_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, СтрокаТаблицаЗапасы);
		// Сформируем проводки.
		Если Окр(СтрокаТаблицаЗапасы.Сумма, 2, 1) <> 0 Тогда
			
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, СтрокаТаблицаЗапасы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = КопияТаблицыЗапасы;
	
КонецПроцедуры

Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Регистратор,
	|	ДоходыИРасходы.НомерСтроки,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	ДоходыИРасходы.СчетУчетаРегл,
	|	ДоходыИРасходы.СуммаДоходов,
	|	ДоходыИРасходы.СуммаРасходов,
	|	ДоходыИРасходы.СодержаниеПроводки,
	|	ДоходыИРасходы.ХозяйственнаяОперация
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Нужны колонки, заполнения в процедуре запасов
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаСписаниеТопливаЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Константы.КонтролироватьОстаткиЗапасовНаСкладахПриПроведении.Получить() Тогда
		
		Результат = УправлениеНебольшойФирмойСервер.ЗапросОтрицательныхОстатковЗапасовНаСкладахПриПроведенииДокумента(ДокументСсылкаСписаниеТопливаЗапасов, ДокументСсылкаСписаниеТопливаЗапасов.СтруктурнаяЕдиница);
		
		Если НЕ Результат.Пустой() Тогда
			ДокументСсылкаПеремещениеЗапасов_Объект = ДокументСсылкаСписаниеТопливаЗапасов.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = Результат.Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов_Объект, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;			
		
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение", "ДвиженияЗапасыИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК ЯчейкаПредставление,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		|			И (ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчетаПредставление,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРеглПредставление,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			Тогда
			
			ДокументОбъектСписаниеТопливаЗапасов = ДокументСсылкаСписаниеТопливаЗапасов.ПолучитьОбъект()
			
		КонецЕсли;
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток учета запасов и затрат.
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда  
			Если НЕ МассивРезультатов[1].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		Иначе
			Если НЕ МассивРезультатов[2].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	//ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(Дата(1,1,1)));
	
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("ka='შტრიხ კოდი';ru='Штрихкод';en='Barcode'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина, ЭтоЗапасы);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("ka='არტიკული';ru='Артикул';en='Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ka='ნომენკლატურა (დასახელება)';ru='Номенклатура (наименование)';en='Nomenclature (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ka='ნომენკლატურა (სრული დასახელება)';ru='Номенклатура (полное наименование';en='Nomenclature (full name'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание", НСтр("ka='შინაარსი';ru='Содержание';en='Content'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика", НСтр("ka='თვისება (დასახელება)';ru='Характеристика (наименование)';en='Characteristics (name)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВнеоборотныеАктивы"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ТранспортныеСредства"));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	//ОписаниеТиповКолонка.Добавить(Новый ОписаниеТипов("СправочникСсылка.ВнеоборотныеАктивы"));
	//ОписаниеТиповКолонка.Добавить(Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства"));
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктивНаименование", НСтр("ru='ОС/Транспортне средство';ka='ძ/ს / სატრანსპორტო საშუალება'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "ВнеоборотныйАктив", 1, , Истина);
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктивКод", НСтр("ru='Инв./Гос. номер';ka='სახელმწიფო ნომერი'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "ВнеоборотныйАктив", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктив", НСтр("ru='ОС/Транспортне средство';ka='ძ/ს / სატრანსპორტო საშუალება'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", НСтр("ka='რაოდენობა';ru='Количество';en='Количество'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Дата", НСтр("ka='თარიღი';ru='Дата';en='Date'"), ОписаниеТиповСтрока25, Новый ОписаниеТипов("Дата"), , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПробегНачало", НСтр("ru='Пробег начало';ka='ოდომეტრის ჩვენება საწყისი'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПробегРазница", НСтр("ru='Пробег (км)';ka='გავლილი კილომეტრაჟი'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПолныйБак", НСтр("ru='Полный бак';ka='ავზი გაივსო'"), ОписаниеТиповСтрока25, Новый ОписаниеТипов("Булево"), , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Подразделение", НСтр("ka='ქვეგანყოფილება';ru='Подразделение';en='Subdivision'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("ka='საზომი ერთეული';ru='Ед. изм.';en='Unit of Measurement'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	//Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	//ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	//
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	//
	//Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	//ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Содержание
		//Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//	
		//	ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Содержание, СтрокаТаблицыФормы.Содержание_ВходящиеДанные);
		//	
		//КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Дата
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.Дата, СтрокаТаблицыФормы.Дата_ВходящиеДанные);
		
		// Пробег Начало
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ПробегНачало, СтрокаТаблицыФормы.ПробегНачало_ВходящиеДанные, 0);
		
		// Пробег пройдено
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ПробегРазница, СтрокаТаблицыФормы.ПробегРазница_ВходящиеДанные, 0);
		
		// Подразделение
		ЗначениеПоУмолчанию = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтруктурнуюЕдиницу(СтрокаТаблицыФормы.Подразделение, СтрокаТаблицыФормы.Подразделение_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// ОС/ТС
		ЗначениеПоУмолчанию = Справочники.ВнеоборотныеАктивы.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВнеоборотныйАктив(СтрокаТаблицыФормы.ВнеоборотныйАктив, СтрокаТаблицыФормы.ВнеоборотныйАктив_ВходящиеДанные);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.ВнеоборотныйАктив) Тогда 
			
			ЗначениеПоУмолчанию = Справочники.ТранспортныеСредства.ПустаяСсылка();
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьТранспортноеСредство(СтрокаТаблицыФормы.ВнеоборотныйАктив, СтрокаТаблицыФормы.ВнеоборотныйАктив_ВходящиеДанные);
			
		КонецЕсли;
		
		// Полный бак
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ПолныйБак, СтрокаТаблицыФормы.ПолныйБак_ВходящиеДанные);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
		И СтрокаТаблицыФормы.Количество <> 0;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "УчетТоплива");
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Макет_СТ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Макет_СТ", "Макет_СТ", НапечататьМакет_СТ(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Макет_СМ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Макет_СМ", "Макет_СМ", НапечататьМакет_СМ(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	
	
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция НапечататьМакет_СМ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Макет_СМ";
	
	МакетОбработки = ПолучитьМакет("Макет_СМ");	 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	МакетПечатнойФормы = ПолучитьМакет("Макет_СМ");
	
	ТабличныйДокумент.Очистить();
	//   
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Макет_СТ";
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТопливаЗапасов_Макет_СТ";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Страница = 1;
	//
	ПервыйДокумент = Истина;
	
	Для Каждого СсылкаНаОбъект из МассивОбъектов Цикл
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеТопливаЗапасов.Макет_СТ");		
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьТабличнаяЧасть = МакетПечатнойФормы.ПолучитьОбласть("ТабличнаяЧасть");
		
		ОбластьПодвал= МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(СсылкаНаОбъект.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		
		
		ОбластьШапки.Параметры.Номер = СсылкаНаОбъект.Номер;
		//ОбластьШапки.Параметры.Дата  = СсылкаНаОбъект.Дата
		
		ОбластьПодвал.Параметры.Ответственный = СсылкаНаОбъект.Ответственный;
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		
		
		//МассивСтрок = Новый Массив; 
		//МассивСтрок.Очистить();		
		//МассивСтрок.Добавить(ОбластьПодвал);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		
		// КолЗапасов = СсылкаНаОбъект.ТаблицаПредложений.Количество();
		
		
		Для Каждого стр из СсылкаНаОбъект.Расходы Цикл
			
			ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
			ОбластьТабличнаяЧасть.Параметры.РасходыДата = стр.Дата;
			ОбластьТабличнаяЧасть.Параметры.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			ОбластьТабличнаяЧасть.Параметры.ВнеоборотныйАктив	 = стр.ВнеоборотныйАктив;
			//ОбластьТабличнаяЧасть.Параметры.ПробегОкончание = стр.ПробегОкончание;
			ОбластьТабличнаяЧасть.Параметры.НомерВА  = стр.НомерВА;
			//ОбластьТабличнаяЧасть.Параметры.ПробегНачало = стр.ПробегНачало;
			//ОбластьТабличнаяЧасть.Параметры.ПробегРазница  = стр.ПробегРазница;
			//ОбластьТабличнаяЧасть.Параметры.ПолныйБак = стр.ПолныйБак;
			
			ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);
			
		КонецЦикла;
		
		//ТабличныйДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаНаОбъект);
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
	
	
КонецФункции

Функция НапечататьМакет_СТ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Макет_СТ";
	
	МакетОбработки = ПолучитьМакет("Макет_СТ");	 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	МакетПечатнойФормы = ПолучитьМакет("Макет_СТ");
	
	ТабличныйДокумент.Очистить();
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТопливаЗапасов.Организация.ФайлЛоготип,
	|	СписаниеТопливаЗапасов.Организация.ФайлПечати
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов КАК СписаниеТопливаЗапасов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	//   
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Макет_СТ";
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТопливаЗапасов_Макет_СТ";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Страница = 1;
	//
	ПервыйДокумент = Истина;
	
	Для Каждого СсылкаНаОбъект из МассивОбъектов Цикл
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеТопливаЗапасов.Макет_СТ");		
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьТабличнаяЧасть = МакетПечатнойФормы.ПолучитьОбласть("ТабличнаяЧасть");			
		ОбластьПодвал= МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		
		//Попытка
		ОбластьШапки.Параметры.Дата	= Формат(СсылкаНаОбъект.Дата , "ДФ=dd.MM.yyyy");
		//Исключение
		//КонецПопытки;
		 ОбластьШапки.Параметры.Организация = СсылкаНаОбъект.Организация;
		
		
		ОбластьШапки.Параметры.Номер = СсылкаНаОбъект.Номер;
		//ОбластьШапки.Параметры.Дата  = СсылкаНаОбъект.Дата
		
		ОбластьПодвал.Параметры.Ответственный = СсылкаНаОбъект.Ответственный;
		
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Организация.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(СсылкаНаОбъект.Организация.ФайлЛоготип);
			ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
		КонецЕсли;
		
		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		
		
		//МассивСтрок = Новый Массив; 
		//МассивСтрок.Очистить();		
		//МассивСтрок.Добавить(ОбластьПодвал);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		
		// КолЗапасов = СсылкаНаОбъект.ТаблицаПредложений.Количество();
		
		
		Для Каждого стр из СсылкаНаОбъект.Расходы Цикл
			
			ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
			ОбластьТабличнаяЧасть.Параметры.РасходыДата = Формат(стр.Дата, "ДФ=dd.MM.yyyy");
			ОбластьТабличнаяЧасть.Параметры.ЕдиницаИзмерения = Строка(стр.Количество) + стр.ЕдиницаИзмерения;
			ОбластьТабличнаяЧасть.Параметры.ВнеоборотныйАктив	 = стр.ВнеоборотныйАктив;
			ОбластьТабличнаяЧасть.Параметры.ПробегОкончание = стр.ПробегОкончание;
			ОбластьТабличнаяЧасть.Параметры.НомерВА  = стр.НомерВА;
			ОбластьТабличнаяЧасть.Параметры.ПробегНачало = стр.ПробегНачало;
			ОбластьТабличнаяЧасть.Параметры.ПробегРазница  = стр.ПробегРазница;
			ОбластьТабличнаяЧасть.Параметры.ПолныйБак = стр.ПолныйБак;
			
			ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);
			
		КонецЦикла;
		
		//ТабличныйДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаНаОбъект);
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Организация.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(СсылкаНаОбъект.Организация.ФайлПечати);
			ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
		КонецЕсли;	
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
	
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Макет_СТ";
	КомандаПечати.Представление 					= НСтр("ka='საწვავის ჩამოწერის აქტი';ru='Списание топлива'");
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 	                        = 1;
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,"ВидОперации",Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Макет_СМ";
	КомандаПечати.Представление 					= НСтр("ka='მასალების ჩამოწერის აქტი';ru='Списание материалов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок                           = 2; 	 
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,"ВидОперации",Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы);
	
КонецПроцедуры

#КонецОбласти
